GHB2/src/InformationRegisters/гхб_ДополнительныеСвойстваПомещений/гхб_ДополнительныеСвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ДополнительныеСвойстваПомещений</name>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныеЗаКонсервациюПомещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныеЗаПожарнуюБезопасность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ДополнительныеСвойстваПомещений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение поля "ДополнительнаяИнформация" для переданного помещения
// Параметры:
//		_Помещение - справочник "гхб_Помещения"
//
Функция ВернутьДополнительнуюИнформациюДляПомещения(_Помещение) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ДополнительныеСвойстваПомещений.ДополнительнаяИнформация КАК ДополнительнаяИнформация
	               |ИЗ
	               |	РегистрСведений.гхб_ДополнительныеСвойстваПомещений КАК гхб_ДополнительныеСвойстваПомещений
	               |ГДЕ
	               |	гхб_ДополнительныеСвойстваПомещений.Помещение = &Помещение";
	
	Запрос.УстановитьПараметр("Помещение", _Помещение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ДополнительнаяИнформация, "");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
